# Create Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCTransformSetter..::..Create Method
IFCTransformSetter Class See Also
---
Creates a new instance of a transform setter.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static IFCTransformSetter Create()
```

Visual Basic
---
```text
Public Shared Function Create As IFCTransformSetter
```

Visual C++
---
```text
public:
static IFCTransformSetter^ Create()
```

# ### Return Value
The new transform setter.
# See Also
IFCTransformSetter Class
Autodesk.Revit.DB.IFC Namespace